wipo-unisa/IPSP02Y - Essential Competition Law/assignments/NLisa_Assignment_02.tex
% Created 2017-04-24 Mon 22:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.80in]{geometry}
\usepackage[backend=bibtex, style=ieee]{biblatex}
\addbibresource{/home/nuk3/course/training/csir/novellasers/bibliography/bibliography.bib}
\DeclareFieldFormat[inproceedings]{citetitle}{\textit{#1}}
\DeclareFieldFormat[inproceedings]{title}{\textit{#1}}
\DeclareFieldFormat[misc]{citetitle}{#1}
\DeclareFieldFormat[misc]{title}{#1}
\renewcommand*{\bibpagespunct}{%
\ifentrytype{inproceedings}
{\addspace}
{\addcomma\space}}
\AtEveryCitekey{\ifuseauthor{}{\clearname{author}}}
\AtEveryBibitem{\ifuseauthor{}{\clearname{author}}}
\author{Nyameko Lisa}
\date{\today}
\title{IPSP02Y - Essential Competition Law\\\medskip
\large Assignment 2 - Unique Number: 724437}
\hypersetup{
 pdfauthor={Nyameko Lisa},
 pdftitle={IPSP02Y - Essential Competition Law},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.5)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Declaration}
\label{sec:orgf25f93d}
\begin{itemize}
\item I know that plagiarism is to use someone else’s work and pass it off as my own.
\item I know that plagiarism is wrong.
\item I confirm that this assignment is my own work.
\item I have acknowledged in the bibliography accompanying the assignment all the sources that I have used.
\item I have not directly copied without acknowledgement anything from the Internet or from any other source.
\item I have indicated every quotation and citation in a footnote or bracket linked to that quotation.
\item I have not allowed anyone else to copy my work and to pass it off as their own work.
\item I understand that if any unacknowledged copying whatsoever appears in my assignment I will receive zero per cent for the assignment.
\item I am aware of the UNISA policy on plagiarism and understand that disciplinary proceedings can be instituted against me by UNISA if I contravene this policy.
\item I indicate my understanding and acceptance of this declaration by
entering my name hereunder:
\begin{itemize}
\item Name: \textbf{Nyameko Lisa} (Student Number: \textbf{7874-909-3})
\end{itemize}
\end{itemize}

\subsection*{NOTE}
\label{sec:orge17f5e0}
Please note that footnotes will be denoted as \footnote{This is a footnote.} and will
appear at the bottom of the page.\\
References will be denoted by \cite{wipo83_paris_conve_protect_ip} and will appear at the end of the document.
\newpage

\section{Discuss quotation from [\citetitle{dijkhorst81_atlas_v_pikkewyn}] \cite{dijkhorst81_atlas_v_pikkewyn} and its compliance with international conventions and other instruments to determine whether competition is unlawful. [10]}
\label{sec:org53f9441}

The law of Republic recognises and grants a general action in the case of
unlawful competition based on the principles of \emph{lex Aquilia.} As per \textbf{the
quotation} from Judge van Dijkhorst \cite{dijkhorst81_atlas_v_pikkewyn} the
difficulty in establishing an action in the case of unlawful competition is to
quantify the degree of unfairness and $\backslash$ or dishonesty. Moreover, as per Judge
van Dijkstra, the ideal legal instrument is one in which the framework for
establishing or trying unlawful competition is well defined and robust enough
to provide adequate direction to the courts, but not so rigid as to restrict
the sentiment of an environment of fair play and open competition.\\

As per [article 10\(^{\text{bis}}\)]\cite{wipo83_paris_conve_protect_ip}, where it is
stipulated that (1) Union member countries must provide adequate protection for
the nationals against unfair competition; (2) dishonest\footnote{Any acts of
competition contrary to honest practices in industrial or commercial matters.}
acts of competition constitutes acts of unfair competition; and finally (3) a
detailed list and description of the forms and nature of acts that would
constitute unlawful competition. \textbf{The quotation} indeed complies with the
requirements of \citetitle{wipo83_paris_conve_protect_ip}.\\

In corroboration to the above [article 1]\cite{wipo96_model_provi_unfair_comp}
emphasises that in the course of industrial or commercial activities an act or
practice that is contrary to honest practices shall be deemed as an act of
unfair competition. Moreover \cite{wipo96_model_provi_unfair_comp} does not
require the entities to be in direct competition, unlike
\cite{wipo83_paris_conve_protect_ip}. The basis for much of the provisions and
notes of \citetitle{wipo96_model_provi_unfair_comp}, are based on those
described in [article 10\(^{\text{bis}}\)]\cite{wipo83_paris_conve_protect_ip}, albeit in much
more detail and specifics. \textbf{The quotation} does indeed comply with these
requirements.\\

As per [article 40]\cite{wto17_trips}, members of the World Trade Organisation,
members are free to determine appropriate methods in implements it's
provisions, moreover regarding competition \cite{wto17_trips} gives particular
attention to intellectual property rights, their abuse and subsequent adverse
effects in relevant markets, trade, transfer and dissemination of
technology. For the most part \textbf{the quotation} is in agreement with the
provisions of \cite{wto17_trips}.


\printbibliography
\end{document}
